Bank: Load Default Risk prediction
- Age
- Annual Income
- City
- Default

In [28]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import PolynomialFeatures

In [29]:
np.random.seed(42) #can write any interger value in place of 42

n_samples = 1000
df = pd.DataFrame({
    'age': np.random.randint(18,60, n_samples),
    'income': np.random.randint(20_000, 150_000, n_samples),
    'city': np.random.choice(['NY', 'Delhi', 'London'], n_samples),
    'default': np.random.choice([0,1],n_samples,p=[0.85,0.15])
})

In [30]:
df.head()

   age  income    city  default
0   56  146108  London        0
1   46   34382   Delhi        0
2   32  104291   Delhi        1
3   25  121195      NY        1
4   38   23756   Delhi        0

In [31]:
#converting categorical into numerocal representataion
df['num_city'] = df['city'].map({'NY':1, 'Delhi':2,'London':3})

In [32]:
df.head()

   age  income    city  default  num_city
0   56  146108  London        0         3
1   46   34382   Delhi        0         2
2   32  104291   Delhi        1         2
3   25  121195      NY        1         1
4   38   23756   Delhi        0         2

In [33]:
#finding non-Linear relationship -> Polynomial Features
poly = PolynomialFeatures(degree = 2, include_bias = False)
poly_features = poly.fit_transform(df[['age', 'income']])
poly_features

array([[5.60000000e+01, 1.46108000e+05, 3.13600000e+03, 8.18204800e+06,
        2.13475477e+10],
       [4.60000000e+01, 3.43820000e+04, 2.11600000e+03, 1.58157200e+06,
        1.18212192e+09],
       [3.20000000e+01, 1.04291000e+05, 1.02400000e+03, 3.33731200e+06,
        1.08766127e+10],
       ...,
       [4.60000000e+01, 1.45816000e+05, 2.11600000e+03, 6.70753600e+06,
        2.12623059e+10],
       [2.50000000e+01, 7.22690000e+04, 6.25000000e+02, 1.80672500e+06,
        5.22280836e+09],
       [2.20000000e+01, 5.85590000e+04, 4.84000000e+02, 1.28829800e+06,
        3.42915648e+09]])

In [39]:
#finding non-Linear relationship -> Polynomial Features

poly = PolynomialFeatures(degree=2, include_bias=False)
poly_features = poly.fit_transform(df[['age', 'income']])
poly_feature_names = poly.get_feature_names_out(['age', 'income'])

df_poly = pd.DataFrame(poly_features, columns=poly_feature_names)
df_poly.head()

    age    income   age^2  age income      income^2
0  56.0  146108.0  3136.0   8182048.0  2.134755e+10
1  46.0   34382.0  2116.0   1581572.0  1.182122e+09
2  32.0  104291.0  1024.0   3337312.0  1.087661e+10
3  25.0  121195.0   625.0   3029875.0  1.468823e+10
4  38.0   23756.0  1444.0    902728.0  5.643475e+08

Assumptions we are making ( why polynomial)
# Older people have good income, but with age comes health risk
# high income = better ability to replay the loans = bad habits or family responsibility ( hidden factors)
# age, income, and [loan]... might not be in a linear relationship
# As this is not linear, we need to build polynomial features to capture realistic patterns.